package com.hkbs.HKBS;

import com.hkbs.HKBS.arkUtil.MyUtil;

import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Locale;

public class MyHoliday {
	static final private String [] SPECIAL = new String [] {
        "20110508母親節",
        "20110619父親節",
        "20120513母親節",
        "20120617父親節",
	    "20130512母親節",
        "20130616父親節",
        "20140511母親節",
		"20140615父親節",
        "20150510母親節",
		"20150621父親節",
        "20150508母親節",
        "20150619父親節"
	};
	static final private String [] HOLIDAYS_HK = new String [] {
		"20110101一月一日",
		"20110203農曆年初一",
		"20110204農曆年初二",
		"20110205農曆年初三",
		"20110405清明節",
		"20110422耶穌受難節",
		"20110423耶穌受難節翌日",
		"20110425復活節星期一",
		"20110502勞動節翌日",
		"20110510佛誕",
		"20110606端午節",
		"20110701香港特別行政區成立紀念日",
		"20110912中秋節翌日",
		"20111001國慶日",
		"20111005重陽節",
		"20111225聖誕節",
		"20111226聖誕節後第一個周日",
		"20111227聖誕節後第二個周日",
		
		"20120101一月一日",
		"20120102元旦翌日",
		"20120123農曆年初一",
		"20120124農曆年初二",
		"20120125農曆年初三",
		"20120404清明節",
		"20120406耶穌受難節",
		"20120407耶穌受難節翌日",
		"20120408復活節",
		"20120409復活節星期一",
		"20120428佛誕",
		"20120501勞動節",
		"20120623端午節",
		"20120701香港特別行政區成立紀念日",
		"20120702香港特別行政區成立紀念日翌日",
		"20120930中秋節",
		"20121001中秋節翌日",
		"20121002國慶日翌日",
		"20121023重陽節",
		"20121225聖誕節",
		"20121226聖誕節後第一個周日",
		
		"20130101一月一日",
		"20130210農曆年初一",
		"20130211農曆年初二",
		"20130212農曆年初三",
		"20130213農曆年初四",
		"20130329耶穌受難節",
		"20130330耶穌受難節翌日",
		"20130401復活節星期一",
		"20130404清明節",
		"20130501勞動節",
		"20130517佛誕",			
		"20130612端午節",
		"20130701香港特別行政區成立紀念日",			
		"20130920中秋節翌日",
		"20131001國慶日",
		"20131014重陽節翌日",
		"20131225聖誕節",
		"20131226聖誕節後第一個周日",
		
		"20140101一月一日",
		"20140131農曆年初一",
		"20140201農曆年初二",
		"20140202農曆年初三",
		"20140203農曆年初四",
		"20140405清明節",
		"20140418耶穌受難節",
		"20140419耶穌受難節翌日",
		"20140420#復活節",
		"20140421復活節星期一",		
		"20140501勞動節",
		"20140506佛誕",
		"20140602端午節",
		"20140701香港特別行政區成立紀念日",
        "20140908#中秋節",
		"20140909中秋節翌日",
		"20141001國慶日",
		"20141002重陽節",
		"20141225聖誕節",
		"20141226聖誕節後第一個周日",
		
		"20150101一月一日",
        "20150219農曆年初一",
        "20150220農曆年初二",
        "20150221農曆年初三",
        "20150403耶穌受難節",
        "20150404耶穌受難節翌日",
        "20150405復活節/清明節",
        "20150406清明節翌日",
        "20150407復活節星期一翌日",
        "20150501勞動節",
        "20150525佛誕",
        "20150620端午節",
        "20150701香港特別行政區成立紀念日",
        "20150927#中秋節", // #Non-holiday special date
        "20150928中秋節翌日",
        "20151001國慶日",
        "20151021重陽節",
        "20151225聖誕節",
        "20151226聖誕節後第一個周日",

            "20160101一月一日",
            "20160208農曆年初一",
            "20160209農曆年初二",
            "20160210農曆年初三",
            "20160325耶穌受難節",
            "20160326耶穌受難節翌日",
            "20160327復活節",
            "20160328復活節星期一",
            "20160404清明節",
            "20160501勞動節",
            "20160502勞動節翌日",
            "20160514佛誕",
            "20160609端午節",
            "20160701香港特別行政區成立紀念日",
            "20160916中秋節翌日",
            "20161001國慶日",
            "20161009重陽節",
            "20161010重陽節翌日",
            "20161225聖誕節",
            "20161226聖誕節後第一個周日",
            "20161226聖誕節後第二個周日"
		
	};
	static final private String [] HOLIDAYS_TW = new String [] {
		"20120101中華民國開國紀念日",
		"20120123春節",
        "20120124春節",
        "20120125春節",
		"20120209農曆除夕",        
        "20120228和平紀念日",
        "20120404兒童節/民族掃墓節",
        "20120623端午節",
        "20120930中秋節",
        "20121010國慶日",
		
		"20130101中華民國開國紀念日",
        "20130209農曆除夕",
        "20130210春節",
        "20130211春節",
        "20130212春節",
        "20130214春節",
        "20130215春節",       
        "20130228和平紀念日",
        "20130404兒童節/民族掃墓節",
        "20130405兒童節/民族掃墓節",
        "20130501勞動節（只限勞工）",
        "20130612端午節",
        "20130903軍人節（只限軍人）",
        "20130919中秋節",
        "20130920中秋節",
        "20131010國慶日",
        
        "20140101中華民國開國紀念日",
        "20140130農曆除夕",
        "20140131春節",
        "20140201春節",
        "20140202春節",
        "20140203春節",
        "20140204春節",                       
        "20140228和平紀念日",
        "20140404兒童節",
        "20140405清明節/民族掃墓節",
        "20140602端午節",        
        "20140908中秋節",
        "20141010國慶日",
        
        "20150101中華民國開國紀念日",
        "20150218農曆除夕",
        "20150219春節",
        "20150220春節",
        "20150221春節",
        "20150222春節",
        "20150223春節",
        "2015227和平紀念日補假",//Fri
        "20150228和平紀念日",//Sat
        "20150403兒童節補假",//Fri
        "20150404兒童節",//Sat
        "20150405清明節/民族掃墓節",//Sun
        "20150406清明節/民族掃墓節補假",//Mon
        "20150619端午節補假",//Fri
        "20150620端午節",//Sat
        "20150928中秋節補假",//Mon
        "20151009國慶日補假",//Fri
        "20151010國慶日",//Sat

	};
	public MyHoliday() {
		// TODO Auto-generated constructor stub
	}
	final static private  SimpleDateFormat sdf = new SimpleDateFormat("yyyyMMdd",Locale.US);
	static public String getHolidayRemark(Date date){
		String dayRemark="";
		String yyyymmdd = sdf.format(date);
		String loopHolidays [];
		if (MyUtil.getCurCountry().equals("HK")){
			loopHolidays=HOLIDAYS_HK;
		} else if (MyUtil.getCurCountry().equals("TW")){
			loopHolidays=HOLIDAYS_TW;
		} else {
			loopHolidays=null;
		}
		if (loopHolidays!=null){
			for (int i=loopHolidays.length-1;i>=0;i--){
				if (loopHolidays[i].startsWith(yyyymmdd)){
					dayRemark = loopHolidays[i].substring(yyyymmdd.length());
					return dayRemark;
				} else if (loopHolidays[i].compareTo(yyyymmdd)<0){
					break;
				}
			}
		}
		for (int i=SPECIAL.length-1;i>=0;i--){
			if (SPECIAL[i].startsWith(yyyymmdd)){
				dayRemark = SPECIAL[i].substring(yyyymmdd.length());
				return dayRemark;
			} else if (SPECIAL[i].compareTo(yyyymmdd)<0){
				break;
			}
		}		
		return dayRemark;
	}
}
