package com.hkbs.HKBS;

import com.hkbs.HKBS.arkUtil.MyUtil;

import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Locale;

public class MyHoliday {
    static final private String [] HOLY_DAYS = new String [] {
            "20151101諸聖日S#G",
            "20151102諸靈日##G",
            "20151108聖靈降臨期#第廿四主日S##",
            "20151115聖靈降臨期#第廿五主日S##",
            "20151122基督君王日#將臨期前主日S##",
            "20151129將臨期第一主日S##",
            "20151130聖安德烈日##G",
            "20151206將臨期第二主日S##",
            "20151207聖尼哥拉日##G",
            "20151213將臨期第三主日S##",
            "20151220將臨期第四主日S##",
            "20151225救主聖誕日#B#",
            "20151226聖士提反日##G",
            "20151227聖誕期第一主日S##",
            "20151228嬰孩被殺日##G",
            "20151229使徒聖約翰日##G",
            "20160101基督聖名日##G",
            "20160103聖誕期第二主日S##",
            "20160106顯現日#B#",
            "20160110基督領洗日#顯現期第一主日S##",
            "20160117顯現期第二主日S##",
            "20160124顯現期第三主日S##",
            "20160125聖保羅受感化日##G",
            "20160126聖提摩太與聖提多日##G",
            "20160131顯現期第四主日S##",
            "20160202奉獻基督於聖殿日##G",
            "20160207顯現期末主日S##",
            "20160210大齋首日#灰日#B#",
            "20160214大齋期第一主日S##",
            "20160221大齋期第二主日S##",
            "20160224聖馬提亞日##G",
            "20160228大齋期第三主日S##",
            "20160306大齋期第四主日S##",
            "20160313大齋期第五主日S##",
            "20160319聖約瑟日##G",
            "20160320棕枝主日S##",
            "20160321聖周星期一#B#",
            "20160322聖周星期二#B#",
            "20160323聖周星期三#B#",
            "20160324聖周星期四#設立聖餐日#B#",
            "20160325救主受難日#B#",
            "20160326聖周星期六#B#",
            "20160327復活日S##",
            "20160328復活周星期一#B#",
            "20160329復活周星期二#B#",
            "20160330復活周星期三#B#",
            "20160331復活周星期四#B#",
            "20160401復活周星期五#B#",
            "20160402復活周星期六#B#",
            "20160403復活期第二主日S##",
            "20160404童貞女馬利亞聞報日##G",
            "20160410復活期第三主日S##",
            "20160417復活期第四主日S##",
            "20160424復活期第五主日S##",
            "20160425聖馬可日##G",
            "20160501復活期第六主日S##",
            "20160502聖腓力日##G",
            "20160505升天日#B#",
            "20160508復活期第七主日#升天日後主日S##",
            "20160509聖基道日##G",
            "20160515聖靈降臨日#五旬節S##",
            "20160522三一主日#聖靈降臨期第一主日S##",
            "20160529聖靈降臨期#第二主日S##",
            "20160531聖母訪親日##G",
            "20160605聖靈降臨期#第三主日S##",
            "20160611聖巴拿巴日##G",
            "20160612聖靈降臨期#第四主日S##",
            "20160614聖巴西流日##G",
            "20160619聖靈降臨期#第五主日S##",
            "20160624施洗聖約翰日##G",
            "20160626聖靈降臨期#第六主日S##",
            "20160629聖彼得日##G",
            "20160703聖多馬日S#G",
            "20160710聖靈降臨期#第八主日S##",
            "20160711聖本德日##G",
            "20160717聖靈降臨期#第九主日S##",
            "20160722聖抺大拉馬利亞日##G",
            "20160724聖靈降臨期#第十主日S##",
            "20160725聖雅各日##G",
            "20160731聖靈降臨期#第十一主日S##",
            "20160806基督易容顯光日##G",
            "20160807聖靈降臨期#第十二主日S##",
            "20160814聖靈降臨期#第十三主日S##",
            "20160821聖靈降臨期#第十四主日S##",
            "20160824聖巴多羅買日##G",
            "20160828聖靈降臨期#第十五主日S##",
            "20160829聖奧古斯丁日##G",
            "20160904聖靈降臨期#第十六主日S##",
            "20160908童貞女聖馬利亞日##G",
            "20160911聖靈降臨期#第十七主日S##",
            "20160914聖十架日##G",
            "20160918聖靈降臨期#第十八主日S##",
            "20160921聖馬太日##G",
            "20160925聖靈降臨期#第十九主日S##",
            "20160929聖米迦勒與諸天使日##G",
            "20161002聖靈降臨期#第二十主日S##",
            "20161004聖法蘭西斯日##G",
            "20161009聖靈降臨期#第廿一主日S##",
            "20161016聖靈降臨期#第廿二主日S##",
            "20161018聖路加日##G",
            "20161023聖靈降臨期#第廿三主日S##",
            "20161028聖西門與聖猶大日##G",
            "20161030聖靈降臨期#第廿四主日S##",
            "20161101諸聖日##G",
            "20161102諸靈日##G",
            "20161106聖靈降臨期#第廿五主日S##",
            "20161113聖靈降臨期#第廿六主日S##",
            "20161120基督君王日#將臨期前主日S##",
            "20161123聖紀文日##G",
            "20161125聖傑靈日##G",

			"20161127將臨期第一主日S##",
			"20161130聖安德烈日###",

			"20161204將臨期第二主日S##",
			"20161206聖尼哥拉日###",
			"20161211將臨期第三主日S##",
			"20151218將臨期第四主日S##",

			"20151225救主聖誕日S##",//"20151227聖誕期第一主日S##",
			"20151226聖士提反日###",
			"20151227使徒聖約翰日###",
			"20151228嬰孩被殺日###"

//			"20170101基督聖名日###",
//			"20170106顯現日###",//"20170106聖誕期第二主日###",
//			"20170108基督領洗日S##",
//			"20170115顯現期第二主日S##",//"20170110基督領洗日#顯現期第一主日S##",
//			"20170122顯現期第三主日S##",
//			"20170125聖保羅受感化日##G",
//			"20170126聖提摩太與聖提多日##G",
//			"20170129顯現期第四主日S##",
//
//			"20170202奉獻基督於聖殿日##G",
//            "20170205顯現期第五主日S##",
//            "20170212顯現期第六主日S##",
//            "20170219顯現期第七主日S##",
//            "20170224聖馬提亞日##G",
//			"20170226顯現期末主日S##",
//
//			"20170301大齋首日#灰日#B#",
//			"20170305大齋期第一主日S##",
//            "20170308春季齋期###",
//            "20170310春季齋期###",
//            "20170311春季齋期###",
//			"20170312大齋期第二主日S##",
//			"20170319大齋期第三主日S##",
//            "20170320聖約瑟日###",
//            "20170325聖貞女馬利亞聞報日###",
//			"20170326大齋期第四主日S##",
//
//            "20170402大齋期第五主日S##",
//			"20170409棕枝主日S##",
//
//			"20170410聖周星期一#B#",
//			"20170411聖周星期二#B#",
//			"20170412聖周星期三#B#",
//			"20170413聖周星期四#設立聖餐日#B#",
//			"20170414救主受難日#B#",
//			"20170415聖周星期六#B#",
//			"20170416復活日S##",
//
//			"20170417復活周星期一#B#",
//			"20170418復活周星期二#B#",
//			"20170419復活周星期三#B#",
//			"20170420復活周星期四#B#",
//			"20170421復活周星期五#B#",
//			"20170422復活周星期六#B#",
//			"20170423復活期第二主日S##",
//
//			"20170410復活期第三主日S##",
//			"20170417復活期第四主日S##",
//			"20170424復活期第五主日S##",
//			"20170425聖馬可日##G",
//			"20170501復活期第六主日S##",
//			"20170502聖腓力日##G",
//			"20170505升天日#B#",
//			"20170508復活期第七主日#升天日後主日S##",
//			"20170509聖基道日##G",
//			"20170515聖靈降臨日#五旬節S##",
//			"20170522三一主日#聖靈降臨期第一主日S##",
//			"20170529聖靈降臨期#第二主日S##",
//			"20170531聖母訪親日##G",
//			"20170605聖靈降臨期#第三主日S##",
//			"20170611聖巴拿巴日##G",
//			"20170612聖靈降臨期#第四主日S##",
//			"20170614聖巴西流日##G",
//			"20170619聖靈降臨期#第五主日S##",
//			"20170624施洗聖約翰日##G",
//			"20170626聖靈降臨期#第六主日S##",
//			"20170629聖彼得日##G",
//			"20170703聖多馬日S#G",
//			"20170710聖靈降臨期#第八主日S##",
//			"20170711聖本德日##G",
//			"20170717聖靈降臨期#第九主日S##",
//			"20170722聖抺大拉馬利亞日##G",
//			"20170724聖靈降臨期#第十主日S##",
//			"20170725聖雅各日##G",
//			"20170731聖靈降臨期#第十一主日S##",
//			"20170806基督易容顯光日##G",
//			"20170807聖靈降臨期#第十二主日S##",
//			"20170814聖靈降臨期#第十三主日S##",
//			"20170821聖靈降臨期#第十四主日S##",
//			"20170824聖巴多羅買日##G",
//			"20170828聖靈降臨期#第十五主日S##",
//			"20170829聖奧古斯丁日##G",
//			"20170904聖靈降臨期#第十六主日S##",
//			"20170908童貞女聖馬利亞日##G",
//			"20170911聖靈降臨期#第十七主日S##",
//			"20170914聖十架日##G",
//			"20170918聖靈降臨期#第十八主日S##",
//			"20170921聖馬太日##G",
//			"20170925聖靈降臨期#第十九主日S##",
//			"20170929聖米迦勒與諸天使日##G",
//			"20171002聖靈降臨期#第二十主日S##",
//			"20171004聖法蘭西斯日##G",
//			"20171009聖靈降臨期#第廿一主日S##",
//			"20171016聖靈降臨期#第廿二主日S##",
//			"20171018聖路加日##G",
//			"20171023聖靈降臨期#第廿三主日S##",
//			"20171028聖西門與聖猶大日##G",
//			"20171030聖靈降臨期#第廿四主日S##",
//			"20171101諸聖日##G",
//			"20171102諸靈日##G",
//			"20171106聖靈降臨期#第廿五主日S##",
//			"20171113聖靈降臨期#第廿六主日S##",
//			"20171120基督君王日#將臨期前主日S##",
//			"20171123聖紀文日##G",
//			"20171125聖傑靈日##G"
    };
	static final private String [] SPECIAL = new String [] {
        "20110508母親節",
        "20110619父親節",
        "20120513母親節",
        "20120617父親節",
	    "20130512母親節",
        "20130616父親節",
        "20140511母親節",
	    "20140615父親節",
        "20150510母親節",
	    "20150621父親節",
        "20160508母親節",
        "20160619父親節",
        "20170514母親節",
        "20170618父親節"
	};
	static final private String [] HOLIDAYS_HK = new String [] {
		"20110101一月一日",
		"20110203農曆年初一",
		"20110204農曆年初二",
		"20110205農曆年初三",
		"20110405清明節",
		"20110422耶穌受難節",
		"20110423耶穌受難節翌日",
		"20110425復活節星期一",
		"20110502勞動節翌日",
		"20110510佛誕",
		"20110606端午節",
		"20110701香港特別行政區成立紀念日",
		"20110912中秋節翌日",
		"20111001國慶日",
		"20111005重陽節",
		"20111225聖誕節",
		"20111226聖誕節後第一個周日",
		"20111227聖誕節後第二個周日",
		
		"20120101一月一日",
		"20120102元旦翌日",
		"20120123農曆年初一",
		"20120124農曆年初二",
		"20120125農曆年初三",
		"20120404清明節",
		"20120406耶穌受難節",
		"20120407耶穌受難節翌日",
		"20120408復活節",
		"20120409復活節星期一",
		"20120428佛誕",
		"20120501勞動節",
		"20120623端午節",
		"20120701香港特別行政區成立紀念日",
		"20120702香港特別行政區成立紀念日翌日",
		"20120930中秋節",
		"20121001中秋節翌日",
		"20121002國慶日翌日",
		"20121023重陽節",
		"20121225聖誕節",
		"20121226聖誕節後第一個周日",
		
		"20130101一月一日",
		"20130210農曆年初一",
		"20130211農曆年初二",
		"20130212農曆年初三",
		"20130213農曆年初四",
		"20130329耶穌受難節",
		"20130330耶穌受難節翌日",
		"20130401復活節星期一",
		"20130404清明節",
		"20130501勞動節",
		"20130517佛誕",			
		"20130612端午節",
		"20130701香港特別行政區成立紀念日",			
		"20130920中秋節翌日",
		"20131001國慶日",
		"20131014重陽節翌日",
		"20131225聖誕節",
		"20131226聖誕節後第一個周日",
		
		"20140101一月一日",
		"20140131農曆年初一",
		"20140201農曆年初二",
		"20140202農曆年初三",
		"20140203農曆年初四",
		"20140405清明節",
		"20140418耶穌受難節",
		"20140419耶穌受難節翌日",
		"20140420#復活節",
		"20140421復活節星期一",		
		"20140501勞動節",
		"20140506佛誕",
		"20140602端午節",
		"20140701香港特別行政區成立紀念日",
        "20140908#中秋節",
		"20140909中秋節翌日",
		"20141001國慶日",
		"20141002重陽節",
		"20141225聖誕節",
		"20141226聖誕節後第一個周日",
		
		"20150101＊一月一日",
        "20150219＊農曆年初一",
        "20150220＊農曆年初二",
        "20150221＊農曆年初三",
        "20150403耶穌受難節",
        "20150404耶穌受難節翌日",
        "20150405＊復活節/清明節",
        "20150406清明節翌日",
        "20150407復活節星期一翌日",
        "20150501＊勞動節",
        "20150525佛誕",
        "20150620＊端午節",
        "20150701＊香港特別行政區成立紀念日",
        "20150927#中秋節", // #Non-holiday special date
        "20150928＊中秋節翌日",
        "20151001＊國慶日",
        "20151021＊重陽節",
        "20151225＊聖誕節",
        "20151226聖誕節後第一個周日",

            "20160101＊一月一日",
            "20160208＊農曆年初一",
            "20160209＊農曆年初二",
            "20160210＊農曆年初三",
            "20160325耶穌受難節",
            "20160326耶穌受難節翌日",
            "20160327復活節",
            "20160328復活節星期一",
            "20160404＊清明節",
            "20160501＊勞動節",
            "20160502勞動節翌日",
            "20160514佛誕",
            "20160609＊端午節",
            "20160701＊香港特別行政區成立紀念日",
            "20160916＊中秋節翌日",
            "20161001＊國慶日",
            "20161009＊重陽節",
            "20161010重陽節翌日",
            "20161225＊聖誕節",
            "20161226聖誕節後第一個周日",
            "20161227聖誕節後第二個周日",

            "20170102*一月一日翌日",
            "20170128*農曆年初一",
			"20170129*農曆年初二",
            "20170130*農曆年初三",
            "20170131*農曆年初四",
            "20170404*清明節",
            "20170414耶穌受難節",
            "20170415耶穌受難節翌日",
            "20170417復活節",
            "20170501*勞動節",
            "20170503佛誕",
            "20170701*香港特別行政區成立紀念日",
            "20171002*國慶日翌日",
            "20171005*中秋節翌日",
            "20171028*重陽節",
            "20171225*聖誕節",
            "20171226聖誕節後第一個周日"
	};
	static final private String [] HOLIDAYS_TW = new String [] {
		"20120101中華民國開國紀念日",
		"20120123春節",
        "20120124春節",
        "20120125春節",
		"20120209農曆除夕",        
        "20120228和平紀念日",
        "20120404兒童節/民族掃墓節",
        "20120623端午節",
        "20120930中秋節",
        "20121010國慶日",
		
		"20130101中華民國開國紀念日",
        "20130209農曆除夕",
        "20130210春節",
        "20130211春節",
        "20130212春節",
        "20130214春節",
        "20130215春節",       
        "20130228和平紀念日",
        "20130404兒童節/民族掃墓節",
        "20130405兒童節/民族掃墓節",
        "20130501勞動節（只限勞工）",
        "20130612端午節",
        "20130903軍人節（只限軍人）",
        "20130919中秋節",
        "20130920中秋節",
        "20131010國慶日",
        
        "20140101中華民國開國紀念日",
        "20140130農曆除夕",
        "20140131春節",
        "20140201春節",
        "20140202春節",
        "20140203春節",
        "20140204春節",                       
        "20140228和平紀念日",
        "20140404兒童節",
        "20140405清明節/民族掃墓節",
        "20140602端午節",        
        "20140908中秋節",
        "20141010國慶日",
        
        "20150101中華民國開國紀念日",
        "20150218農曆除夕",
        "20150219春節",
        "20150220春節",
        "20150221春節",
        "20150222春節",
        "20150223春節",
        "2015227和平紀念日補假",//Fri
        "20150228和平紀念日",//Sat
        "20150403兒童節補假",//Fri
        "20150404兒童節",//Sat
        "20150405清明節/民族掃墓節",//Sun
        "20150406清明節/民族掃墓節補假",//Mon
        "20150619端午節補假",//Fri
        "20150620端午節",//Sat
        "20150928中秋節補假",//Mon
        "20151009國慶日補假",//Fri
        "20151010國慶日",//Sat

	    "20160101中華民國開國紀念日",
        "20160208春節",
        "20160209春節",
        "20160210春節",
        "20160211春節",
        "20160212春節",
        "20160228和平紀念日",
        "20160229和平紀念日補假",
        "20160404兒童節/民族掃墓節",
        "20160405兒童節/民族掃墓節補假",
        "20160609端午節",
        "20160610端午節彈性放假",
        "20160915中秋節",
        "20160916中秋節彈性放假",
        "20161010國慶日",

        "20170101中華民國開國紀念日",
        "20170102中華民國開國紀念日補假",
        "20170127除夕",
        "20170128農曆年初一",
        "20170129農曆年初二",
        "20170130農曆年初三",
        "20170131農曆年初四",
        "20170201農曆年初五",
        "20170227和平紀念日彈性放假",
        "20170228和平紀念日",

        "20170403兒童節",
        "20170404民族掃墓節",

        "20170529端午節彈性放假",
        "20170530端午節",
        "20171004中秋節",
        "20171009國慶日彈性放假",
        "20171010國慶日"

	};
	public MyHoliday() {
		// TODO Auto-generated constructor stub
	}
	final static private  SimpleDateFormat sdf = new SimpleDateFormat("yyyyMMdd",Locale.US);
    static public String getHolyDayText(Date date){
        String dayRemark="";
        String yyyymmdd = sdf.format(date);
        String loopHolyDays [] = HOLY_DAYS;
        if (loopHolyDays!=null){
            for (int i=loopHolyDays.length-1;i>=0;i--){
                if (loopHolyDays[i].startsWith(yyyymmdd)){
                    dayRemark = loopHolyDays[i].substring(yyyymmdd.length());
                    return dayRemark.substring(0,dayRemark.length()-3);
                } else if (loopHolyDays[i].compareTo(yyyymmdd)<0){
                    break;
                }
            }
        }
        return dayRemark;
    }
	static public String getHolidayRemark(Date date){
		String dayRemark="";
		String yyyymmdd = sdf.format(date);
		String loopHolidays [];
        boolean isHongKong=false;
		if (MyUtil.getCurCountry().equals("HK")){
			loopHolidays=HOLIDAYS_HK;
            isHongKong=true;
		} else if (MyUtil.getCurCountry().equals("TW")){
			loopHolidays=HOLIDAYS_TW;
		} else {
			loopHolidays=null;
		}
		if (loopHolidays!=null){
			for (int i=loopHolidays.length-1;i>=0;i--){
				if (loopHolidays[i].startsWith(yyyymmdd)){
					dayRemark = loopHolidays[i].substring(yyyymmdd.length());
					return dayRemark;
				} else if (loopHolidays[i].compareTo(yyyymmdd)<0){
					break;
				}
			}
		}
        if (isHongKong) { // Only HK use Mother Day; Father Day
            for (int i = SPECIAL.length - 1; i >= 0; i--) {
                if (SPECIAL[i].startsWith(yyyymmdd)) {
                    dayRemark = SPECIAL[i].substring(yyyymmdd.length());
                    return dayRemark;
                } else if (SPECIAL[i].compareTo(yyyymmdd) < 0) {
                    break;
                }
            }
        }
		return dayRemark;
	}
}
